In [41]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [42]:
char = ['a','b','c']
data = [10,20,30]
arr = np.array(data)
mapa = {'a':10,'b':20,'c':30}

In [43]:
arr

array([10, 20, 30])

In [44]:
pd.Series(data,char)

a    10
b    20
c    30
dtype: int64

In [45]:
np.random.seed(101)

In [46]:
npt = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['l','ch','i','o'])
npt

          l        ch         i         o
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [47]:
npt>0

       l     ch      i      o
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [48]:
valor = 'G1 G2 G3 G4 G5 G6'.split()
llave = [1, 2, 3, 4, 5, 6]
mapaunid = list(zip(valor, llave))
mapaunid = pd.MultiIndex.from_tuples(mapaunid)

In [49]:
df = pd.DataFrame(randn(6,2),mapaunid,['a','b'])
df

             a         b
G1 1  0.302665  1.693723
G2 2 -1.706086 -1.159119
G3 3 -0.134841  0.390528
G4 4  0.166905  0.184502
G5 5  0.807706  0.072960
G6 6  0.638787  0.329646

In [50]:
df.loc['G2']

          a         b
2 -1.706086 -1.159119

In [51]:
md = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
dfmd = pd.DataFrame(md)
dfmd

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [56]:
dfmd.fillna(value='Valor predeterminado')

                      A                     B  C
0                   1.0                   5.0  1
1                   2.0  Valor predeterminado  2
2  Valor predeterminado  Valor predeterminado  3

In [60]:
company = {'Company':['Google', 'Micrsoft' ,'Apple' ,'Adobe', 'Meta'],
           'Person':['Sam' ,'Charlie', 'Bob', 'Alice','Marry'],
           'Sales':[100,200,300,400,500]}
dfcompany = pd.DataFrame(company)
dfcompany

    Company   Person  Sales
0    Google      Sam    100
1  Micrsoft  Charlie    200
2     Apple      Bob    300
3     Adobe    Alice    400
4      Meta    Marry    500

In [66]:
byCompany = dfcompany.groupby('Company')
byCompany.mean